Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Those libraries, collected in the CPAN, provide ready-made solutions to an astounding array of problems.
ru_ru: Те библиотеки, которые лежат на CPAN, дают готовые решения поразительному множеству проблем.

source: Throughout Perl's documentation, you'll find numerous examples intended to help explain the discussed features.
ru_ru: На протяжении документации Perl, вы найдете многочисленные примеры, предназначенные, чтобы помочь объяснить обсуждаемые особенности (features).

source: Throughout the previous section all the examples have used the syntax:
ru_ru: На протяжении предыдущего раздела во всех примерах мы использовали синтаксис:

source: Throughout this document you'll see references to other parts of the Perl documentation.
ru_ru: В этом документе вы увидите ссылки на другие части документации Perl.

source: Thus a warning on the 2nd line of the program, which is on the 100th line in the file will be reported as line 2, not as line 100.
ru_ru: Таким образом, предупреждение на 2-й строке программы, которая находится на 100-й строчку в файле будут представлены как линии 2, а не как строка 100.

source: Thus, if you're on a machine that allows only one argument with the C<#!> line, or worse, doesn't even recognize the C<#!> line, you still can get consistent switch behaviour regardless of how Perl was invoked, even if B<-x> was used to find the beginning of the program.
ru_ru: Таким образом, если вы на машине, которая позволяет только один аргумент на строке C<#!>, или еще хуже, даже не признает C<#!> линии, вы все равно можете получить согласованное поведение переключателя независимо от того, как Perl был вызван, даже если B<-x> был использован, чтобы найти начало программы.

source: To avoid stepping on each other's toes, they need to be sure to use different keys in the hash.
ru_ru: Чтобы не наступать друг другу на пальцы, они должны быть уверены, чтобы использовать различные ключи в хэше.

source: To determine at runtime if this capability has been compiled in your perl, you can check the value of C<$Config{usesitecustomize}>.
ru_ru: Чтобы определить, во время выполнения, если эта возможность была скомпилирована в вашем Perl, вы можете проверить значение C<$Config{usesitecustomize}>.

source: To get at hash elements:
ru_ru: Чтобы добраться до элементов хеша:

source: To get multiple values from an array:
ru_ru: Чтобы получить несколько значений из массива:

source: To learn how to install modules you download from CPAN, read L<perlmodinstall>.
ru_ru: Чтобы узнать, как установить модули, загруженные из CPAN, читайте L<perlmodinstall> .

source: To learn how to use a particular module, use C<perldoc I<Module::Name>>.
ru_ru: Чтобы узнать, как использовать конкретный модуль, используйте C<perldoc I<Module::Name>>.

source: To read more about them check their respective manual pages at L<strict> and L<warnings>.
ru_ru: Чтобы узнать больше об этом - посмотрите соответствующие страницы руководства на L<strict> и L<warnings> .

source: To run a Perl program from the Unix command line:
ru_ru: Чтобы запустить программу Perl из командной строки Unix:

source: To start up I<sh> rather than I<csh>, some systems may have to replace the C<#!> line with a line containing just a colon, which will be politely ignored by Perl.
ru_ru: Для запуска I<sh> , а не I<csh>, некоторые системы, возможно, придется заменить строку с C<#!> строкой содержащей только двоеточие, которая будет вежливо игнорироваться Perl.

source: To suppress printing use the B<-n> switch.
ru_ru: Чтобы подавить печать используйте флаг B<-n>.

source: To watch how it executes your program, use B<-Dtls>.
ru_ru: Чтобы посмотреть, как он выполняет свою программу, используйте B<-Dtls>.

source: Truncated patterns are treated as though they are suffixed with sufficient 0's as required.
ru_ru: Усеченный шаблоны обрабатываются как будто они суффикс достаточной 0, как это требуется.

source: Typical uses are in Unix:
ru_ru: Типичное применение: Unix:

source: Typically this is used to emulate C<#!> startup on platforms that don't support C<#!>.
ru_ru: Обычно это используется для эмуляции C<#!> запуска на платформах, которые не поддерживают C<#!>.

source: Typically you will want to C<use I<Module::Name>>, which will then give you access to exported functions or an OO interface to the module.
ru_ru: Обычно вы можете использовать объявление C<use I<Module::Name>>, которое дает вам доступ к экспортируемым функциям или OO ориентированный интерфейс к модулю.

source: UTF-8, then the selected "IOEioA" are in effect
ru_ru: UTF-8, потом выбирается "IOEioA" в действительности (UTF-8, then the selected "IOEioA" are in effect)

source: Unix's C<#!> technique can be simulated on other systems:
ru_ru: Юниксовая C<#!> техника может быть смоделирована на других системах:

source: Unlike the octal form, this one may be used to specify any Unicode character, even those beyond 0xFF.
ru_ru: В отличие от восьмеричной формы, это может быть использовано для указания любого символ в Юникоде, даже тех, которые идут за 0xFF.

source: Unlike in earlier versions of Perl, C<:raw> is I<not> just the inverse of C<:crlf>: other layers which would affect the binary nature of the stream are also removed or disabled.
ru_ru: В отличие от более ранних версий Perl, C<:raw> I<не> просто обратная C<:crlf>: другие слои, которые будут влиять на двоичный характер потока также удалить или отключить.

source: Up to 3.14_05, the switch B<-v> was used to produce verbose messages of B<perldoc> operation, which is now enabled by B<-D>.
ru_ru: До 3.14_05, переключатель B<-v> использовался для получения подробных сообщений из B<perldoc> операции, которая теперь включен по B<-D>.

source: Use an index if it is present.
ru_ru: Используйте индекс, если он присутствует.

source: Use with the same care as is reserved for nitroglycerine.
ru_ru: Используйте с такой же тщательностью, как зарезервировано для нитроглицерина.

source: Used if C<chdir> has no argument and HOME is not set.
ru_ru: Используется, если C<chdir> не имеет аргументов и HOME не установлен.

source: Used if C<chdir> has no argument.
ru_ru: Используется, если C<chdir> не имеет аргументов.

source: Used if chdir has no argument and HOME and LOGDIR are not set.
ru_ru: Используется, если ChDir не имеет аргументов, домашнего и LOGDIR не установлены.

source: Used in executing subprocesses, and in finding the program if B<-S> is used.
ru_ru: Используется для выполнения подпроцессов, и в поиске программы, если используется B<-S>.

source: Useful values for C<PERLDOC> include C<-oterm>, C<-otext>, C<-ortf>, C<-oxml>, and so on, depending on what modules you have on hand; or the formatter class may be specified exactly with C<-MPod::Perldoc::ToTerm> or the like.
ru_ru: Полезные значения для C<PERLDOC> включают C<-oman>, C<-otext>, C<-otk>, C<-ortf>, C<-oxml> и так далее, в зависимости от имеющихся у вас модулей; или явно укажите класс определяющий форматирование с помощью C<-MPod::Perldoc::ToMan> или подобного.

source: User pragmata store their state by writing to the magical hash C<%^H>, hence these two routines manipulate it.
ru_ru: Пользовательские прагмы сохраняют свое состояние в магическом хеше C<%^H>, следовательно эти две подпрограммы управляют им.

source: Using C<my> in combination with a C<use strict;> at the top of your Perl scripts means that the interpreter will pick up certain common programming errors.
ru_ru: Использование C<my> в комбинации с C<use strict;> в верхней части вашего Perl скрипта означает, что интерпретатор будет находить некоторые общие ошибки программирования.

source: Using C<strict> is highly recommended.
ru_ru: Использование C<strict> настоятельно рекомендуется.

source: Using our own C<crlf> layer as the buffer avoids those issues and makes things more uniform.
ru_ru: Используя нашу собственную C<crlf> слоя в качестве буфера позволяет избежать этих проблем и делает вещи более равномерным.

source: Using the C<use strict> pragma ensures that all variables are properly declared and prevents other misuses of legacy Perl features.
ru_ru: Использование прагмы C<use strict> гарантирует, что все переменные объявлены правильно и предотвращает другие злоупотребления от наследия функций Perl.

source: We can manipulate C<@_> in other ways too:
ru_ru: Мы можем управлять C<@_> и в других случаях тоже:

source: We list some of the books here, and while listing a book implies our endorsement, don't think that not including a book means anything.
ru_ru: Перечислим некоторые из книг здесь, и перечисляя книги подразумеваем нашу поддержку, не думаю, что не включение книги что-нибудь означает.

source: We've already seen how to print to standard output using C<print()>.
ru_ru: Мы уже видели, как печатать на стандартный вывод с помощью C<print()>.

source: Well, the arguments to a subroutine are available to us as a special array called C<@_> (see L<perlvar> for more on that).
ru_ru: Ну, аргументы подпрограммы доступны нам как специальный массив C<@_> (см. L<perlvar> более подробно об этом).

source: What's that C<shift>?
ru_ru: Что такое C<shift>?

source: When they haven't set the standard themselves, they steal from the best -- just like Perl itself.
ru_ru: Когда они не ставят стандартные библиотеки, они крадут из лучших -- точно так же, как сам Perl.

source: When combined with setting PERL_HASH_SEED this mode is as close to pre 5.18 behavior as you can get.
ru_ru: В сочетании с установкой PERL_HASH_SEED этот режим как можно ближе к предварительно 5,18 поведения как вы можете получить.

source: When perl exits, cleanly or not, the original I<file> is unlinked.
ru_ru: Когда Perl выходит, чисто или нет, исходный I<файл> удаляется (unlinked).

source: When possible, it's good for both F</usr/bin/perl> and F</usr/local/bin/perl> to be symlinks to the actual binary.
ru_ru: Когда это возможно, это хорошо как для F</usr/bin/perl> и F</usr/local/bin/perl> быть символическими ссылками на фактические двоичные файлы.

source: When running taint checks (either because the program was running setuid or setgid, or because the B<-T> or B<-t> switch was used), this variable is ignored.
ru_ru: При запуске проверки меток (taint check) (либо потому, что программа работает SETUID или SETGID, или потому что были использованы ключи B<-T> или B<-t>), эта переменная игнорируется.

source: When running taint checks, either because the program was running setuid or setgid, or the B<-T> or B<-t> switch was specified, neither PERL5LIB nor PERLLIB is consulted.
ru_ru: При запуске проверок меток ( taint checks), либо потому, что программа работает SETUID или SETGID или B<-T> или B<-t> опции были указаны ни PERL5LIB ни PERLLIB не спрашиваются.

source: When set to C<"1"> or C<"RANDOM"> then traversing keys will be randomized.
ru_ru: При установке на C<"1"> или C<"RANDOM"> Затем клавишами перемещения будут рандомизированы.

source: When set to C<"2"> or C<"DETERMINISTIC"> then inserting keys into a hash will cause the key order to change, but in a way that is repeatable from program run to program run.
ru_ru: При установке на C<"2"> или C<"DETERMINISTIC"> ; со вставкой ключей в хэш причинит ключевой для изменения, но таким образом, что повторяется от программы запуска на выполнение программы.

source: When you're done with your filehandles, you should C<close()> them (though to be honest, Perl will clean up after you if you forget):
ru_ru: Когда вы закончите с вашим дескрипторов файлов, вы должны использовать C<close()> для закрытия (хотя, честно говоря, Perl будет убирать за вами, если вы забыли):

source: While none of the built-in data types have any arbitrary size limits (apart from memory size), there are still a few arbitrary limits: a given variable name may not be longer than 251 characters.
ru_ru: Хотя ни один из встроенных типов данных не имеет любые произвольные ограничения на размер (кроме памяти), есть еще несколько произвольных ограничений: данное имя переменной не может быть длиннее 251 символов.

source: Whitespace is irrelevant:
ru_ru: Пробелы не имеют значения:

source: Why does -i clobber protected files?
ru_ru: Почему -i разбивает (clobber) защищенные файлы?

source: Win32's "stdio" has a number of bugs/mis-features for Perl IO which are somewhat depending on the version and vendor of the C compiler.
ru_ru: Win32 в "stdio" имеет ряд ошибок/MIS-функций (bugs/mis-features) для Perl IO которых несколько в зависимости от версии и поставщик компилятора C.

source: With Perl 5.10 you are no longer limited to the built in pragmata; you can now create user pragmata that modify the behaviour of user functions within a lexical scope.
ru_ru: С выходом Perl 5.10 вы не ограничены в разработке прагм, теперь можете создавать пользовательские прагмы, которые будут менять поведение пользовательских функций в лексическом контексте.

source: With methods 2 and 3, Perl starts parsing the input file from the beginning, unless you've specified a B<-x> switch, in which case it scans for the first line starting with C<#!> and containing the word "perl", and starts there instead.
ru_ru: С методами 2 и 3, Perl начинает анализировать входной файла с самого начала, если вы не указали опцию B<-x>, и в этом случае производится проверка первой строки, которая начинается с C<#!> и содержит слово " Perl ", и начинает там вместо этого.

source: Writing subroutines is easy:
ru_ru: Написание подпрограмм легко:

source: You can disable or promote into fatal errors specific warnings using C<__WARN__> hooks, as described in L<perlvar> and L<perlfunc/warn>.
ru_ru: Вы можете отключить или продвижения в фатальные ошибки конкретные предупреждения использованием хука C<__WARN__> , как описано в L<perlvar> и L<perlfunc/warn> .

source: You are I<strongly> advised to follow this introduction with more information from the full Perl manual, the table of contents to which can be found in L<perltoc>.
ru_ru: Я I<строго> рекомендую следовать этому введению, дополнительную информацию о полной Perl документации и ее оглавление можно найти в L<perltoc>.

source: You are advised to use a specific path if you care about a specific version.
ru_ru: Вам рекомендуется использовать определенный путь, если вы заботитесь о конкретной версии интерпретатора Perl.

source: You can also put directly the path to your perl executable, like in C<#!/usr/bin/perl>).
ru_ru: Вы также можете поместить непосредственно путь к исполняемому файлу perl, например, C<#!/usr/bin/perl>).

source: You can also specify the separator character using hexadecimal notation: B<-0xI<HHH...>>, where the C<I<H>> are valid hexadecimal digits.
ru_ru: Вы также можете указать символ-разделитель с помощью шестнадцатеричного формата: B<-0xI<HHH...>>, Где C<I<H>> действительные шестнадцатеричные цифры.

source: You can also use C<while> in a post-condition:
ru_ru: Вы также можете использовать C<while> в пост-условии:

source: You can also use binmode() to set the encoding of an I/O stream.
ru_ru: Вы также можете использовать binmode(), чтобы установить кодировку потока ввода/вывода.

source: You can do various useful things to lists:
ru_ru: Вы можете делать различные полезные вещи списках:

source: You can get and set the key traversal mask for a specific hash by using the C<hash_traversal_mask()> function from L<Hash::Util>.
ru_ru: Вы можете получать и устанавливать ключ обхода маску для конкретной хэш с помощью C<hash_traversal_mask()> функции из L<Hash::Util> .

source: You can get at lists of keys and values with C<keys()> and C<values()>.
ru_ru: Вы можете получить в списки ключей и значений используя функции C<keys()> и C<values()> .

source: You can get more documentation, tutorials and community support online at L<http://www.perl.org/>.
ru_ru: Вы можете получить более подробную документацию, руководства и интернет-сообщество поддержки на L<http://www.perl.org/>.

source: You can now invoke the program directly, by saying C<perl program>, or as a DCL procedure, by saying C<@program> (or implicitly via F<DCL$PATH> by just using the name of the program).
ru_ru: Теперь вы можете вызвать программу непосредственно, говоря C<perl program> Или в виде DCL (Digital Command Language цифровой командный язык) процедуры, говоря, C<@program> (или косвенно через F<DCL$PATH> только с помощью название программы).

source: You can open a file for input or output using the C<open()> function.
ru_ru: Вы можете открыть файл для ввода или вывода с помощью функции C<open()>.

source: You can read from an open filehandle using the C<< <> >> operator.
ru_ru: Вы можете прочитать из открытого файлового манипулятора используя оператор C<< <> >> .

source: You can read that documentation using the C<perldoc> command or whatever method you're using to read this document.
ru_ru: Вы можете прочитать эту документацию с помощью команды C<perldoc> или любым другим методом, который вы используете для чтения этого документа.

source: You can specify several classes to try by joining them with commas or semicolons, as in C<-MTk::SuperPod;Tk::Pod>.
ru_ru: Вы можете указать несколько классов, разделив их запятыми или точкой с запятой, например: C<-MTk::SuperPod;Tk::Pod>.

source: You can then in theory take this core dump and turn it into an executable file by using the I<undump> program (not supplied).
ru_ru: Затем можно теоретически воспользоваться этим дампом и превратить его в исполняемый файл с помощью программы I<undump> (не прилагается).

source: You can use B<-C0> (or C<"0"> for C<PERL_UNICODE>) to explicitly disable all the above Unicode features.
ru_ru: Вы можете использовать B<-C0> (или C<"0"> для C<PERL_UNICODE>, чтобы явно отключить все выше Unicode особенности (features).

source: You can use C<"0"> to "disable Unicode", though (or alternatively unset PERL_UNICODE in your shell before starting Perl).
ru_ru: Вы можете использовать C<"0">, чтобы "отключить Unicode", хотя (или, альтернативно, отключенное PERL_UNICODE в вашей оболочке перед запуском Perl).

source: You can use C<-w optionname> (without a value) as shorthand for C<-w optionname:I<TRUE>>.
ru_ru: Вы можете использовать C<-w название-параметра> (без значения) в качестве короткой записи C<-w название-параметра:I<TRUE>>.

source: You can use C<eof> without parentheses to locate the end of each input file, in case you want to append to each file, or reset line numbering (see example in L<perlfunc/eof>).
ru_ru: Вы можете использовать C<eof> без скобок, чтобы найти в конце каждого входного файла, в случае, если вы хотите добавить к каждому файлу, или сбросить нумерацию строк (см. пример в L<perlfunc/eof>).

source: You can use an "=" instead of the ":", as in: C<-w textsize=15>.
ru_ru: Можете использовать "=" вместо ":", т. е. C<-w textsize=15>.

source: You can use parentheses for functions' arguments or omit them according to your personal taste.
ru_ru: Вы можете использовать скобки для аргументов функций или опустить их в соответствии с вашим личным вкусом.

source: You can use quotes to add extra code after the module name, e.g., C<'-MI<MODULE> qw(foo bar)'>.
ru_ru: Вы можете использовать кавычки, чтобы добавить дополнительный код после имени модуля, например, C<'-MI<MODULE> qw(foo bar)'>.

source: You can use whitespace and the C<< => >> operator to lay them out more nicely:
ru_ru: Можно использовать пробелы и оператору C<< => >>, чтобы выложить их для более наглядного представления:

source: You can write to other opened file descriptors in a variety of ways:
ru_ru: Вы можете написать другим открываемым дескрипторов файлов в различных формах:

source: You can't use literal whitespace in the pattern.
ru_ru: Вы не можете использовать буквальные пробелы в шаблоне.

source: You cannot use B<-i> to create directories or to strip extensions from files.
ru_ru: Вы не можете использовать B<-i> для создания каталогов или для обрезания расширений файлов.

source: You don't just have to match on fixed strings.
ru_ru: Вы не просто должны совпадать по фиксированной строке.

source: You may also give a descriptive name of a page, such as C<perlfunc>.
ru_ru: Также вы можете задать имя страницы документации, например С<perlfunc>.

source: You may mail your bug reports (be sure to include full configuration information as output by the myconfig program in the perl source tree, or by C<perl -V>) to perlbug@perl.org .
ru_ru: Вы можете отправить ваши сообщения об ошибке (не забудьте включить полную информацию о конфигурации в качестве вывода myconfig программы в Perl дереве исходных текстов, или посредством C<perl -V>) на perlbug@perl.org .

source: You may wish to remove it.
ru_ru: Вы можете удалить его.

source: You might want to run at least once with the B<-w> switch to perl, which will warn you if you use == where you should have used eq.
ru_ru: Возможно, вы захотите запустить по крайней мере один раз с B<-w> опцией to perl, которая предупредит вас если вы используете == где вы должны были использовать eq.

source: You might also have to change a single % to a %%.
ru_ru: Вы можете также изменить одну % на a %%.

source: You might be tempted to use C<$#array + 1> to tell you how many items there are in an array.
ru_ru: Можно было бы попытаться использовать C<$#array + 1>, чтобы сказать вам, сколько элементов есть в массиве.

source: You might need to modify any loop that iterates over such an array.
ru_ru: Возможно, вам придется изменить любой цикл, который перебирает такой массив.

source: You might notice several familiar Perl concepts in this collection of ACM columns from Jon Bentley.
ru_ru: Вы могли заметить несколько знакомых Perl понятий в этой коллекции столбцов ACM от Jon Bentley.

source: You might want to keep these desktop references close by your keyboard:
ru_ru: Возможно, вы захотите, чтобы эти ссылки столе рядом с вашей клавиатурой:

source: You perhaps were thinking of C<:crlf:bytes> or C<:perlio:bytes>.
ru_ru: Вы, возможно, думали о C<:crlf:bytes> или C<:perlio:bytes>.

source: You probably want to make sure that all your switches fall either before or after that 32-character boundary.
ru_ru: Вы, наверное, хотите, чтобы убедиться, что все ваши переключатели действуют до или после 32-символьной границы.

source: You should go through and check them.
ru_ru: Вы должны пройти через них и проверить.

source: You will need a C<:crlf> layer above it to do that.
ru_ru: Вы будете нуждаться в C<:crlf> слой над ним, чтобы сделать это.

source: You'll need to learn the special characters in your command-interpreter (C<*>, C<\> and C<"> are common) and how to protect whitespace and these characters to run one-liners (see L<-e|/-e commandline> below).
ru_ru: Вам нужно будет узнать специальные символы при запуске интерпретатора из командной строки (C<*>, C<\> and C<"> являются общими) и как защитить пробелы и эти символы для запуска однострочников (см. L<-e|/-e commandline> ниже).

source: You'll want to set $# explicitly if you use the default value of OFMT.
ru_ru: Вам придется установить $# явно, если вы используете значение по умолчанию OFMT.

source: Your system may also have man pages installed for those modules, in which case you can probably just use the man(1) command.
ru_ru: На вашей системе тоже могут быть установлены руководства по этим модулям. В этом случае вы можете пользоваться командой man(1).

source: [-L language_code]
ru_ru: [-L код_языка]

source: [-M FormatterClassName]
ru_ru: [-M названиеклассаформата]

source: [-d destination_file]
ru_ru: [-d файл_назначения]

source: [-n nroff-replacement]
ru_ru: [-n nroff-аналог]

source: [-o formatname]
ru_ru: [-o название_формата]

source: [-w formatteroption:value]
ru_ru: [-w параметрформатирования:значение]

source: [^aeiou] matches a single character outside the given
ru_ru: [^aeiou] соответствует одному символу вне данного набора

source: [aeiou] matches a single character in the given set
ru_ru: [aeiou] соответствует одному символу в данном наборе
